import React from 'react';
// import { Input,Button } from 'reactstrap'
// import styled from 'styled-components'


class RuleWiFiText extends React.Component {
  render() {
    return (
      <React.Fragment>
          &nbsp;ระเบียบการใช้บริการระบบเครือข่ายมหาวิทยาลัย (ตามพระราชบัญญัติว่าด้วยการกระทำความผิดเกี่ยวกับคอมพิวเตอร์ พ.ศ. 2550)<br/>
          &nbsp;&nbsp;&nbsp;&nbsp;1.ผู้ใดทำให้เสียหาย ทำลาย แก้ไข เปลี่ยนแปลง หรือเพิ่มเติมไม่ว่าทั้งหมดหรือบางส่วน ซึ่งข้อมูลคอมพิวเตอร์ของผู้อื่นโดยมิชอบ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ(มาตรา 9)<br />
          &nbsp;&nbsp;&nbsp;&nbsp;2.ผู้ใดกระทำด้วยประการใดโดยมิชอบ เพื่อให้การทำงานของระบบคอมพิวเตอร์ของผู้อื่นถูกระงับ ชะลอ ขัดขวาง หรือรบกวนจนไม่สามารถทำงานตามปกติได้ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ(มาตรา 10)<br />
          &nbsp;&nbsp;&nbsp;&nbsp;3.ผู้ใดกระทำความผิดที่ระบุไว้ดังต่อไปนี้ ต้องระวางโทษจำคุกไม่เกินห้าปี หรือปรับไม่เกินหนึ่งแสนบาท หรือทั้งจำทั้งปรับ<br /><br />
               

        <ul style={{ listStyleType: 'none' }}>
          <li>(1) นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ปลอมไม่ว่าทั้งหมดหรือบางส่วน หรือข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิดความเสียหายแก่ผู้อื่นหรือประชาชน</li>
          <li>(2) นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์อันเป็นเท็จ โดยประการที่น่าจะเกิคความเสียหายต่อความมั่นคงของประเทศหรือก่อให้เกิดความตื่นตระหนกเเก่ประชาชน</li>
          <li>(3) นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใด ๆ อันเป็นความผิดเกี่ยวกับความมั่นคงแห่งราชอาณาจักรหรือความผิดเกี่ยวกับการก่อการร้ายตามประมวลกฎหมายอาญา</li>
          <li>(4) นำเข้าสู่ระบบคอมพิวเตอร์ซึ่งข้อมูลคอมพิวเตอร์ใด ๆ ที่มีลักษณะอันลามกและขัอมูลคอมพิวเตอร์นั้นประชาชนทั่วไปอาจเข้าถึงได้</li>
          <li>(5) เผยแพร่หรือส่งต่อซึ่งข้อมูลคอมพิวเตอร์โดยรู้อยู่แล้วว่าเป็นข้อมูลคอมพิวเตอร์ตาม(1)(2)(3) หรือ(4)(มาตรา 14)</li>
        </ul>

        ข้าพเจ้ารับทราบระเบียบในการใช้บริการ และจะรับผิดชอบต่อความเสียหายต่าง ๆ ที่เกิดขึ้น ในกรณีที่ไม่สามารถระบุถึงผู้ใช้งาน Internet Account ตามที่ข้าพเจ้าได้ขอมานี้
      </React.Fragment>
    );
  }
};

export default RuleWiFiText;